simulation/deltaTheta_0/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletB
    {
        type            fixedValue;
        value           uniform 1; 
       
    }

    outletB
    {
        type            zeroGradient;
        value           uniform 0; 
    }

    wallsB
    {
        type            constantAlphaContactAngle;
        theta0          90;
	limit		gradient;
        value           uniform 0; 
    }

    solidRest
    {
        type            constantAlphaContactAngle;
        theta0          90;
        limit           gradient;
        value           uniform 0;
    }

    frontAndBack
    {
	type		empty;
    }

    "r.*"
    {
        type            constantAlphaContactAngle;
        theta0          90;
        limit           gradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
